/*
Вклад в банке составляет x рублей. Ежегодно он увеличивается на p процентов, после чего дробная часть копеек отбрасывается. Каждый год сумма вклада становится больше. Определите, через сколько лет вклад составит не менее y рублей.

x * p / 1

Входные данные
Программа получает на вход три натуральных числа: x, p, y.

Выходные данные
Программа должна вывести одно целое число.
*/

package main

import "fmt"

func main() { 
	var x int
	var y int
	var p int

	fmt.Scan(&x, &p, &y)

	for y := 1; x <= y; y++ {
		
		if x * p
	}


}
